#pragma once

// Will To Live Online (0.57) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "WTLOnline_AB_Male_TPC_Anim_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass AB_Male_TPC_Anim.AB_Male_TPC_Anim_C
// 0xB82C (0xC68C - 0x0E60)
class UAB_Male_TPC_Anim_C : public UWTLCharacterBodyAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x0E60(0x0008) (CPF_ZeroConstructor, CPF_Transient, CPF_DuplicateTransient)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_B7685CDC400B2A80CAAD81BF74149BC1;// 0x0E68(0x0040)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0EA8(0x0008) MISSED OFFSET
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_A69E84A84F2EC2BA6EF2B59E9903B3CF; // 0x0EB0(0x0240)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_D3B57D4F4511DB76EFF3898D3809FB51; // 0x10F0(0x0240)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_4957D5A3497F1111E9BD7D9EB0DDA9A2;// 0x1330(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8EC42FA84F4082F62A4730ACD0050B28;// 0x1408(0x0048)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C64892F54D4DC2738EDA24A25C6766DD;// 0x1450(0x00D0)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_7E585B554FF7C03161F4359616CB2EDA; // 0x1520(0x0240)
	struct FAnimNode_TwoBoneIK                         AnimGraphNode_TwoBoneIK_CE5CD1FA45BD5DA513DF22A23E50787E; // 0x1760(0x0240)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B74122F844624E7433C465B4600FAD60;// 0x19A0(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B4EAA56F409683284316C1A8A166339D;// 0x19E8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_45B354DA4196F93D90EF9C9A4322BEC8;// 0x1A30(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_753CDFEA4482A7236814F1A9F2F59650;// 0x1A78(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DC7C93AA45428CC9C6C7F583DA5B841F;// 0x1AC0(0x0048)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_875C408B4B8E0B5C2EAD57BE2DB0E12F;// 0x1B08(0x0068)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F0CD1B3F45C686F1F0DD4DBECC0EBA5C;// 0x1B70(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_45C2ADF04CF8A39E55BD02AEE87A6520;// 0x1C10(0x0048)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_0862AA5C44E60FBC08E7BDBAA477FD23;// 0x1C58(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_40FF3974489F7FDE81A026BEE65A49E1;// 0x1C98(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_90A764CE4525852D1E9BAFA6B00B0F4F;// 0x1D38(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_00FF30DE4B3A2C3C4164BFAA88D60195;// 0x1D78(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_55B9815A4E767C941F5928AE74BA74AB;// 0x1E18(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_382E54304AEDFB89ED1E7DB476563167;// 0x1E58(0x0048)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_838947D6497DA8B57EF081983D65E232;// 0x1EA0(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_6406EBA54325C7ADEDEE76B97673A716;// 0x1EE0(0x00E0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_AEBFAB4245C629E9C1F841B12666792B;// 0x1FC0(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E6020A9E40E49F31DB3C5A81ABCC58EB;// 0x2098(0x0048)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_7CAFA58249CC48BD92037F8F81A6B159;// 0x20E0(0x0040)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_3130142F47748BE817E28C804C91D538;// 0x2120(0x00F0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_366F8AD6484CB5FB279A0B8A808F4DDF;// 0x2210(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_BE5EB2BF4563205C8F0DA8973935246B;// 0x2300(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_34B31E634B394714CB30C1BCB0B85840;// 0x23A0(0x0128)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_93C6624248A434EB1A9D0FB8B77A9496;// 0x24C8(0x01E0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_1516E41A4AFFC5427347C092EFF88997;// 0x26A8(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_0272EBB740E6C8652E9720A341335C82;// 0x27E0(0x0138)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_2B2A6D774A478F7F92C32393739FC830;// 0x2918(0x00A0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_F43E2F6C4E967FAD5D3DE08DE6808528;// 0x29B8(0x00F0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_1C17CE69430F22FA4974C1900056CFC1;// 0x2AA8(0x0138)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_2C28B0E14B7405E9796266BBF61EA63A;      // 0x2BE0(0x0068)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_A4CAC6204169C009FA395E9D241E24D3;      // 0x2C48(0x0068)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_27E12C9D48FFC01FEE8D0EA67A0B4CF3;// 0x2CB0(0x01E0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_AC6BDD22465B9560331899801DB0F20D;// 0x2E90(0x00D8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_48E854B349A8F77F6DEF80B40FC8B413;// 0x2F68(0x00D8)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_2E655A8B4A72F26F73EC1CADB103F104;// 0x3040(0x01E0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_79BDEFD14E184445B28F969763F737F0;// 0x3220(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_7D83B61D41E3F1B6B83DB38D31B79A94;// 0x3358(0x0138)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_E071F73740A1F162AC558EAC841663D5;  // 0x3490(0x0128)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_08139F664FD65B84C47F78B012FBAC0C;// 0x35B8(0x0138)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_E4F8882F4494BF938016DB8438DF319E;// 0x36F0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3F285C3841AE597F0C9813B7A044CED8;// 0x37C0(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_63C66C7340CA2CC4EF0E7BAD8274D06F;// 0x3860(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F7C3E9E6481B970F53A1ED92F0C09EEF;// 0x3938(0x00A0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_B50F44724A1096495949FB92484F3578;// 0x39D8(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_917A28714BAC190F8F9A1BADAACEE51B;// 0x3AB0(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_0F4A202B49734CA20F1102B39D9C7F62;// 0x3B88(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_60D82E164E31AD6CB199C9AAE4143EE9;// 0x3C60(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_DBB08C2A4C96CA1E6FB78E9599B5D165;// 0x3CA8(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_15B8FB19472B8A6CC961318AF23CFD84;// 0x3CF0(0x00A0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_C7CFA3A347EA937A4B1D51AD1C6BD954;  // 0x3D90(0x0128)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_DCAEE2F84A818649C504CD8C1D98FA35;// 0x3EB8(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_7388B0E6497E691E4B3E9FAB0D5B143A;// 0x3FF0(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_64065F7E40276EC349502EAF0C88F500;// 0x4128(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_FD20880F42C96B8176CA16B67BC8363B;// 0x4260(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_CDCFA60B458A0ADE5BCA94A52A8251D0;// 0x4398(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_2A6D955A4609CCDE00C6F197AB88952E;// 0x44D0(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_434E4D2C4F7163AAADD3C2A01869D38C;// 0x4608(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_B01F6DD2445D5FADFF3EB7B14DF37817;// 0x4740(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_A700BDBF428A3C415E22268EDAA1AE38;// 0x4878(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_AFC52F5E4A65254DE404E38A7A75CA31;// 0x49B0(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_99839DD04461F2C3F1C765829586C63D;// 0x4AE8(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_79B4ADD14AC7D6F947D5CE8AF3D0024D;// 0x4C20(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_CAE66C0846957E43FAD214B7326A225E;// 0x4D58(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_972EB1DE4AE3913DC2620AB26FC45474;// 0x4E90(0x0138)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_6C7A173C47211F71D6360ABABAC445AF;      // 0x4FC8(0x0068)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_BAA02253492D7C0F09BE47BD4D228747;// 0x5030(0x00F0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F620490F4DD5DCFF28CD0A95EDFE8427;// 0x5120(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F6621EAF4AD5204386DDE1AEA2A481DD;// 0x51C0(0x00A0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_54AD2DD0481ECEFBAC30359D29B5B1A1;// 0x5260(0x00F0)
	struct FAnimNode_CopyBone                          AnimGraphNode_CopyBone_63EA29AB46532C30FF954E9C732E7E6A;  // 0x5350(0x0128)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_F6D9AB7C4792E0AE7195FE954C43933A;// 0x5478(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_D67E2FFF4133BC153C0542B43697DE7C;// 0x55B0(0x0138)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_138F4F6D4FC27E248E33E58A05B50D75;// 0x56E8(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_942E15394316C5770EA069A18D5326EF;// 0x57B8(0x00A0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_E8CA73A64D3DC034C3E32885829D789F;// 0x5858(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_C7085DF4473F1C41301B34B80891F62C;// 0x5898(0x0040)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_3335D26F4DFC55D3838DC39F5C862F9E;// 0x58D8(0x00F8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_2FF2574647A3ED116801A489162EAE9D;      // 0x59D0(0x0068)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_F902A3D743241A85BA562F89E68D821C;      // 0x5A38(0x0068)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_738DD8D14B5DB8873B36F48AE5A86025;// 0x5AA0(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A500743D49EC66E2A3A65A884C7D530F;// 0x5B70(0x00A0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_4AE553974FCA12EEDA12089A71B6CD5A;      // 0x5C10(0x0068)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_7DD6E6C84901B713A6B81EB437A79B1A;// 0x5C78(0x01E0)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_06262FD941E8EC239E1DF1A580933E14;// 0x5E58(0x00D0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_DF8895874045C3B1B0A3B1A999130DAA;// 0x5F28(0x00A0)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_0AF096964882A792CDF2FBA54380FC3B;// 0x5FC8(0x00F0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3092E6EE495D2F3745D63282FA651722;// 0x60B8(0x0048)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_E5F028B04D0DBC5355169AB8EBF3BF7C;// 0x6100(0x0068)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0E8A1F814BF4A08634B81CA2C4751A77;// 0x6168(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_64D90DE849B23DBC28C730A26B53458E;// 0x6208(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D02FAD734749229C05291B98B89DEC67;// 0x6250(0x0048)
	struct FAnimNode_ApplyAdditive                     AnimGraphNode_ApplyAdditive_E9022E184077514CEA915C83F511121A;// 0x6298(0x00F0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_DAAF4BC84AD12D8FA0E88F96AA23EE45;// 0x6388(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_8F8FEDF74ECA28DAC02B6A94260E21D0;// 0x63D0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3FF36F224AC010FA32293089D9C1C1CA;// 0x6418(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_73BBDB294BC6C3E5C0A43AB8B3B37CDE;// 0x6460(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_128755AE4FA806C30ECA50BBADFFE972;// 0x64A8(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_BD9C994F420909A62D732B81BD6987A1;// 0x6548(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_EF5D567544BC176F7C7C4DBF3582535A;// 0x6670(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_87A168E64DCFF31CAAF807B8CCABCA16;// 0x6798(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_AB4C8F6940BEBFC7D809289196D68A74;// 0x68C0(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_37630DD249393A312CDD97966A3D868E;// 0x69E8(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_618816794038DEC64169EAB180653ED8;// 0x6B10(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6D5E603F4E7031B4F89B5D857EEB0678;// 0x6BE8(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_68FDD5EF4EC2DB2AE96D308B80FAA80E;// 0x6C88(0x0128)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_431AEA9A4C7A9307CFC22CAA608E1721;      // 0x6DB0(0x0068)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_362FD3B34C9013679BE306AD9B308BA5;// 0x6E18(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_B975C6F64AE80C29F1FD47B1B86B252E;// 0x6F40(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_5155E04E4D4E3B5A84E048B9CFBA53CA;// 0x7018(0x00A0)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_2FBD4B9A4DC5312926D54FB8AF6E9D74;      // 0x70B8(0x0068)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_2601E5894BDF95806461BEA673DB49AC;// 0x7120(0x0128)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_C3F5209C46C6C14486087FAF94DDA9FB;// 0x7248(0x0128)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_871744A449D5BD671C2D3AA0D64D8E1B;// 0x7370(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_B8067DD14B31EF05D33D4F922899C227;// 0x7448(0x00D8)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_D8F904B84993980B6A2EC9B1DBC8EEDD;// 0x7520(0x00E0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_011CDCAD4978D125DCDBB78C7B9CB9D8;// 0x7600(0x00E0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_62516F3F42B7E36307A11FA39966B951;// 0x76E0(0x00E0)
	struct FAnimNode_BlendListByEnum                   AnimGraphNode_BlendListByEnum_7DDA1D36444EFCEBA11DB8B88CA6AA36;// 0x77C0(0x00E0)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_897574E84322631CF474F08C59B09051;// 0x78A0(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_228ACAAA4306C3AA0D00249D60623B8C;// 0x7978(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_1ADE2B2E4769CF62BD40A5BF4A0746FD;// 0x79C0(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_AAE4E7C342276B5D93FC93B215A7586C;      // 0x7A08(0x0068)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_0056122E41B9769E771C25A6AF043095;// 0x7A70(0x00D8)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_12369E454B8DA4AE8A0936BEAC2A4179;// 0x7B48(0x0128)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_B47AE7374AEDC0C481EFBC8FDA107B35;// 0x7C70(0x00D8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_065A275B4ABA37E21F9878A63D74EA03;// 0x7D48(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_43746DF74C30DEAC57DDAA9055C4A9DB;// 0x7E80(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_AB1F63694137E45BCE526CA58CCD98B5;// 0x7FB8(0x0138)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_578CFCA34870AD1E762D109051829EEF;// 0x80F0(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6F0C50534F88148672F57DAEB0C0C143;// 0x81C8(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_F66750D147202AA2931D20B61F66003A;// 0x8210(0x0048)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_7D0AFA4644BE43AE3760BDA9ABDC21B9;// 0x8258(0x0128)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_FF2B0E1E41A01CC758FABAB981D86763;// 0x8380(0x00D0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_B3457073465E19ACAB2381B092A7D3C0;// 0x8450(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_0C7592CB4903F4F917CD12AB3EBF0EC2;// 0x8490(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_8B49A9944D02C60C5173E49C3C9FB391;// 0x84D0(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C3519B464B7397321B33299F9F2017AC;// 0x8510(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_31F0F30848C81B00AED891954E8BACAD;// 0x8550(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_23C6FA1649BC050B9ED52A8ABB4B0168;// 0x85F0(0x0128)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_E5574C9D46E4E11E32346E894140288A;// 0x8718(0x00D8)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_6D54432B46716215C7EABE91A6A5FA04;// 0x87F0(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_37BC9CAF43A3D555EDFDD4BB68E8273D;// 0x8928(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_ADDBA95547DF7D04B1D2E5AD295EEA5D;// 0x8A60(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_C8D7BE224DD1A74C0C9334AD603FCB83;// 0x8B98(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_7BD6B43F4624FBE9ADDF17986DD1AB30;// 0x8CD0(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_9D8386974C6DF5A10EF6A9BD1363F6BD;// 0x8E08(0x0138)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_E1BD815D4D9401E82569D592D0F087F2;// 0x8F40(0x0138)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_B4E97BC84D766FDD5E653E85F630DC7C;// 0x9078(0x01E0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_37A54B424672EEE06564B0A3A58803E5;// 0x9258(0x00D8)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EB779F494B92533581674D9060E7532E;// 0x9330(0x00A0)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_BD77AC2347E6A1A641F3A392CB07A0F7;// 0x93D0(0x0128)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_B09184E0432E25BC5295369880E967E4;// 0x94F8(0x0068)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_C88385D8458D937D6EB057A083D380DB;// 0x9560(0x00D0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_38AB24C2494B3B88C92EAEBD6D3096DA;// 0x9630(0x0048)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_8CA8F9354AB1AD983FBE5592499A446D;      // 0x9678(0x0068)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_706C96DB4E912F48CF95CEB28A740C9F;      // 0x96E0(0x0068)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_5729F36E4C9DCF59BDAD3AA086A2BA48;      // 0x9748(0x0068)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_6CE2022E4912AE905C3979A10F6B6D14;// 0x97B0(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_453350E542DE5CEA7DC41099CA40BFF2;// 0x9888(0x0048)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_868919B2426BC483DAB5D0A51A3E3D54;// 0x98D0(0x01E0)
	struct FAnimNode_RotationMultiplier                AnimGraphNode_RotationMultiplier_3259637A4D8AFA4061434590C427E95B;// 0x9AB0(0x0128)
	struct FAnimNode_RotationMultiplier                AnimGraphNode_RotationMultiplier_D4223A5644491D436492E3AC0AEC289E;// 0x9BD8(0x0128)
	struct FAnimNode_RotationMultiplier                AnimGraphNode_RotationMultiplier_FD80D50F434E316CDD8B429E91F3F2FC;// 0x9D00(0x0128)
	struct FAnimNode_RotationMultiplier                AnimGraphNode_RotationMultiplier_3ACFEF6C4565ADDE2BE905AF5495DCF4;// 0x9E28(0x0128)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_3434F733455AE3E6898D6A810D2C0094;// 0x9F50(0x0138)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_4F5F5C304E68A03971B23CA0F47B7949;// 0xA088(0x00D8)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_5173BF7D41ED601910067B85002C3F93;// 0xA160(0x00D8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_327E9F7E4F5CA501619918A67FB6329F;// 0xA238(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EB6460AA458BF6F55E8A1E83FAA17032;// 0xA280(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_62AA3F1F4DD323E7A75FBD92027D9BE0;// 0xA2C8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_795FD7FC49ACF4B01DA40BBC16095D53;// 0xA310(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1EAF752D4ACBE5684F7A8A8795145F92;// 0xA358(0x0048)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_09E319C84266EF47196285B3A10EEBCF;// 0xA3A0(0x0068)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_D31B6D324BCF7D7AAD2FB4B038CAFDFC;// 0xA408(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7F76955D4F0427491A38739BF84AED4D;// 0xA450(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_B2E8E4674BD92533E29FBA8B7E6F8D0D;// 0xA4F0(0x0040)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_3A1CC88C4950C489432C498088869092;// 0xA530(0x00F8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_6F2F4B5146AB112ACD260F8604646349;// 0xA628(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_07C294874B7E7853D938B19DA92A63E1;// 0xA670(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_8E071DE34588AEA407853480A7F0D8C3;// 0xA710(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_7B5EB32C49FA0361338116A5002010AB;// 0xA750(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_CF18708B422D9CCB24E7CE8C016906BC;// 0xA7F0(0x0040)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_CC6ADE55444EFEC2225CCB8768037C80;// 0xA830(0x0048)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_16F51FD64413D6AC9F149A8AC998D5DF;// 0xA878(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_A77345A646FCBEC440F65F90A762142B;// 0xA8B8(0x00E0)
	unsigned char                                      UnknownData01[0x8];                                       // 0xA998(0x0008) MISSED OFFSET
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_80F45AB44ED1E342F193449D4C19D6C5;    // 0xA9A0(0x01F0)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_776CF0D7444B71E59210769606BE9496;// 0xAB90(0x00F8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_4338C1D5485B2810936AF19FD41B394B;// 0xAC88(0x0048)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_0162B64B42E886FB7155939D422BA8BA;// 0xACD0(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_3DBA70F347C9D509F6836A952B7DAFDD;// 0xADA8(0x0048)
	struct FAnimNode_TwoWayBlend                       AnimGraphNode_TwoWayBlend_6975BB0841DEBCF711890B91803A53A6;// 0xADF0(0x00F8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_83D0A8034D31758F6CC411ACEE7D0A0C;// 0xAEE8(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_D4A1CF394BF810A0571674B3E915B685;// 0xAF30(0x00D8)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_B6F8400B450A3678774C1EAC29CBE7ED;// 0xB008(0x01E0)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_876B922144EEC5E8FEC955BAFF3E4C76;// 0xB1E8(0x01E0)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_C8A18A654A5050E3E7FEE086DA1C7FD0;// 0xB3C8(0x0068)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_2F324A5D4E0FD79934F1C494DEE15844;// 0xB430(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0DF2F08C4F8CF164FC71B79C56CAF0EB;// 0xB478(0x00A0)
	struct FAnimNode_ApplyMeshSpaceAdditive            AnimGraphNode_ApplyMeshSpaceAdditive_B43EAF294CBB9CF002AFD7BDC1C3471A;// 0xB518(0x0068)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A9EBD1B6445B50442A5D29AB61AEE87D;// 0xB580(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_27C78B2F45A39F31244696ACE59BBB3C;// 0xB5C8(0x00A0)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_E6EA45974A00A20CC63BEE8DC551CD96;// 0xB668(0x0048)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_5D82707F41748EE3C71C48AAFDBA2B8F;// 0xB6B0(0x01E0)
	struct FAnimNode_Root                              AnimGraphNode_Root_1D6B61EA4E441B06F8882DA4C1DE20E4;      // 0xB890(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_4B5581764C69E6A1BB19B2AF05CC8C56;// 0xB8D0(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_323700864416FA3923C6768A059CCE99;// 0xB910(0x0040)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_CA9A2ECD465C8EDD175B41968E718540;      // 0xB950(0x0068)
	struct FAnimNode_RotationOffsetBlendSpace          AnimGraphNode_RotationOffsetBlendSpace_62E145F14FD42B8DEA065C915ADE039A;// 0xB9B8(0x01E0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_226C8F9743F1FFE209E6A1A58D015863;// 0xBB98(0x00D8)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_AB3E3BA74BA72777C3E673850E352452;// 0xBC70(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_A9735B6241BB63EE23AC67858689E2CB;// 0xBD48(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_90EDE4AF48C5169D78B4368F646AAE41;// 0xBD90(0x0048)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_F029A82943F049FD32648DA621FAFDCC;// 0xBDD8(0x00D8)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_813FD2574448ACF0DA720581DB030ACD;      // 0xBEB0(0x0068)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_45318BF247AFBBF16860E3AFC44B5945;// 0xBF18(0x00D8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_7B4BAD91492793DEFD8FCB8D57681CAE;// 0xBFF0(0x0048)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_413E9381478E8DC3877653A9EA79CDCD;// 0xC038(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_4AA9E5D64BD2297D9C53C994137AAD54;// 0xC080(0x0138)
	unsigned char                                      UnknownData02[0x8];                                       // 0xC1B8(0x0008) MISSED OFFSET
	struct FAnimNode_Fabrik                            AnimGraphNode_Fabrik_E1246F5C4F91D941C0466891881DD987;    // 0xC1C0(0x01F0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_6CEC40424677C9E2F4A9DF8AAAEFCC28;// 0xC3B0(0x0138)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_1B4C1FB943CA53BCE71480ACDA9F4F64;// 0xC4E8(0x00A0)
	float                                              RotationSpeedHorizontalWithDirectionMultiplier;           // 0xC588(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	struct FRotator                                    RootBoneRotation;                                         // 0xC58C(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              RotationSpeedHorizontalWithDirectionCurrent;              // 0xC598(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              FootOffset_R;                                             // 0xC59C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              FootOffset_L;                                             // 0xC5A0(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              PelvisZOffset;                                            // 0xC5A4(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	struct FRotator                                    FootRotation_R;                                           // 0xC5A8(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	struct FRotator                                    FootRotation_L;                                           // 0xC5B4(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              FootRotation_R_Alpha;                                     // 0xC5C0(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              FootRotation_L_Alpha;                                     // 0xC5C4(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              PelvisZOffsetTarget;                                      // 0xC5C8(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              FootOffset_R_Target;                                      // 0xC5CC(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              FootOffset_L_Target;                                      // 0xC5D0(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	bool                                               IsPKM;                                                    // 0xC5D4(0x0001) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0xC5D5(0x0003) MISSED OFFSET
	struct FVector                                     PKM_RotationPoint;                                        // 0xC5D8(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	struct FVector                                     PKM_Offset;                                               // 0xC5E4(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	struct FVector                                     PKM_CameraAimOffsetVector;                                // 0xC5F0(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	struct FVector                                     PKM_CameraAimOffsetVectorInverse;                         // 0xC5FC(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              IK_LeftHand_Alpha;                                        // 0xC608(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              IK_RightHand_Alpha;                                       // 0xC60C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              EmptyHandsCurveValue;                                     // 0xC610(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	struct FRotator                                    AimOffsetHeadRotation;                                    // 0xC614(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              PickupAlpha;                                              // 0xC620(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	unsigned char                                      UnknownData04[0xC];                                       // 0xC624(0x000C) MISSED OFFSET
	struct FTransform                                  PickupFABRICEffectorTransform;                            // 0xC630(0x0030) (CPF_Edit, CPF_BlueprintVisible, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              MixEmptyHands;                                            // 0xC660(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              MinCameraOffset;                                          // 0xC664(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              WeaponAimOffset;                                          // 0xC668(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              Rest;                                                     // 0xC66C(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              OneMinusRest;                                             // 0xC670(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              ActionSlotAlpha;                                          // 0xC674(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	struct FVector                                     BackpackTranslation;                                      // 0xC678(0x000C) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              IK_Foot_Alpha;                                            // 0xC684(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)
	float                                              PDA_Alpha;                                                // 0xC688(0x0004) (CPF_Edit, CPF_BlueprintVisible, CPF_ZeroConstructor, CPF_DisableEditOnInstance, CPF_IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("AnimBlueprintGeneratedClass AB_Male_TPC_Anim.AB_Male_TPC_Anim_C"));
		return ptr;
	}


	void DotP(const struct FVector& v1, const struct FVector& v2, float Intencity, float* DotP);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Male_TPC_Anim_AnimGraphNode_TwoWayBlend_776CF0D7444B71E59210769606BE9496();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Male_TPC_Anim_AnimGraphNode_BlendListByBool_C88385D8458D937D6EB057A083D380DB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Male_TPC_Anim_AnimGraphNode_BlendSpacePlayer_23C6FA1649BC050B9ED52A8ABB4B0168();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AB_Male_TPC_Anim_AnimGraphNode_ModifyBone_AB1F63694137E45BCE526CA58CCD98B5();
